{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 12], "name": "input_1", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 12], "name": "input_2", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 12], "name": "input_3", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 12], "name": "input_4", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "gru_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 64, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 12, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "gru_1"}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "gru_3", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 64, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 12, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "gru_3"}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "gru_5", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 64, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 12, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}, "inbound_nodes": [[["input_3", 0, 0]]], "name": "gru_5"}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "gru_7", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 64, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 12, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}, "inbound_nodes": [[["input_4", 0, 0]]], "name": "gru_7"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["gru_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["gru_3", 0, 0]]], "name": "dropout_3"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_5"}, "inbound_nodes": [[["gru_5", 0, 0]]], "name": "dropout_5"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_7"}, "inbound_nodes": [[["gru_7", 0, 0]]], "name": "dropout_7"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dropout_1", 0, 0], ["dropout_3", 0, 0], ["dropout_5", 0, 0], ["dropout_7", 0, 0]]], "name": "merge_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 64}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "dense_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_9"}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dropout_9"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["dropout_9", 0, 0]]], "name": "dense_2"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}}